RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.0.0_a53641a/components/libraries/cli/nrf_cli.c
    return true;
}

/* removes pattern and following space */
static void pattern_from_tmp_buffer_remove(nrf_cli_t const * p_cli,
                                           char const *      p_pattern)
{
    size_t shift;
    char * p_pattern_addr = strstr(p_cli->p_ctx->temp_buff, p_pattern);
    
    nrf_cli_cmd_len_t pattern_len = cli_strlen(p_pattern);

    if (p_pattern_addr == NULL)
    {
        return;
    }

    if (p_pattern_addr > p_cli->p_ctx->temp_buff)
    {
        if (*(p_pattern_addr - 1) == ' ')
        {
            pattern_len++;      /* space needs to be removed as well */
            p_pattern_addr--;   /* set pointer to space */
        }
    }

    shift = cli_strlen(p_pattern_addr) - pattern_len + 1; /* +1 for EOS */
    p_cli->p_ctx->cmd_tmp_buff_len -= pattern_len;

    memmove(p_pattern_addr, p_pattern_addr + pattern_len, shift);
}

/**
 * @internal @brief Function for searching and adding commands matching to wildcard pattern.
 *
 * This function is internal to nrf_cli module and shall be not called directly.
 *
 * @param[in/out] p_cli         Pointer to the CLI instance.
 * @param[in]     p_cmd         Pointer to command which will be processed
 * @param[in]     cmd_lvl       Command level in the command tree.
 * @param[in]     p_pattern     Pointer to wildcard pattern.
 * @param[out]    p_counter     Number of found and added commands.
 *
 * @retval WILDCARD_CMD_ADDED                   All matching commands added to the buffer.
 * @retval WILDCARD_CMD_ADDED_MISSING_SPACE     Not all matching commands added because
 *                                              NRF_CLI_CMD_BUFF_SIZE is too small.
 * @retval WILDCARD_CMD_NO_MATCH_FOUND          No matching command found.
 */
static wildcard_cmd_status_t commands_expand(nrf_cli_t const *           p_cli,
                                             nrf_cli_cmd_entry_t const * p_cmd,
                                             size_t                      cmd_lvl,
                                             char *                      p_pattern,
                                             size_t *                    p_counter)
{
    size_t cmd_idx = 0;
    size_t counter = 0;
    bool   success = false;
    
    nrf_cli_static_entry_t         static_entry;
    nrf_cli_static_entry_t const * p_static_entry = NULL;
    wildcard_cmd_status_t          ret_val = WILDCARD_CMD_NO_MATCH_FOUND;

    do
    {
        cmd_get(p_cmd,
                cmd_lvl,
                cmd_idx++,
                &p_static_entry,
                &static_entry);

        if (p_static_entry == NULL)
        {
            break;
        }

        if (0 == fnmatch(p_pattern, p_static_entry->p_syntax, 0))
        {
            success = command_to_tmp_buffer_add(p_cli,
                                                p_static_entry->p_syntax,
                                                p_pattern);
            if (!success)
            {
                break;
            }
            counter++;
        }

    } while(cmd_idx != 0);

    if (counter > 0)
    {
        *p_counter = counter;
        pattern_from_tmp_buffer_remove(p_cli, p_pattern);

        if (success)
        {
            ret_val = WILDCARD_CMD_ADDED;
        }
        else
        {
            ret_val = WILDCARD_CMD_ADDED_MISSING_SPACE;
        }
    }

    return ret_val;
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)

/* Function is analyzing the command buffer to find matching commands. Next, it invokes the  last recognized
 * command which has a handler and passes the rest of command buffer as arguments. */
static void cli_execute(nrf_cli_t const * p_cli)
{
    char quote;
    size_t argc;
    char * argv[NRF_CLI_ARGC_MAX + 1]; /* +1 reserved for NULL added by function make_argv */

    size_t cmd_idx;             /* currently analyzed command in cmd_level */
    size_t cmd_lvl = NRF_CLI_CMD_ROOT_LVL; /* currently analyzed command level */
    size_t cmd_handler_lvl = 0; /* last command level for which a handler has been found */
    size_t cmd_handler_idx = 0; /* last command index for which a handler has been found */

    nrf_cli_cmd_entry_t const * p_cmd = NULL;

    cmd_trim(p_cli);

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    history_save(p_cli);
#endif

#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
/* Wildcard can be correctly handled under following conditions:
     - wildcard command does not have a handler
     - wildcard command is on the deepest commands level
     - other commands on the same level as wildcard command shall also not have a handler

   Algorithm:
   1. Command buffer is copied to Temp buffer.
   2. Algorithm goes through Command buffer to find handlers and subcommands.
   3. If algorithm will find a wildcard character it switches to Temp buffer.
   4. In the Temp buffer command with found wildcard character is changed into matching command(s).
   5. Algorithm switch back to Command buffer and analyzes next command.
   6. When all arguments are analyzed from Command buffer, Temp buffer is copied to Command buffer.
   7. Last found handler is executed with all arguments in the Command buffer.
*/
    size_t commands_expanded = 0;

    memset(p_cli->p_ctx->temp_buff, 0, sizeof(p_cli->p_ctx->temp_buff));
    memcpy(p_cli->p_ctx->temp_buff,
           p_cli->p_ctx->cmd_buff,
           p_cli->p_ctx->cmd_buff_len);

    /* Function spaces_trim must be used instead of make_argv. At this point it is important to keep
       temp_buff as a one string. It will allow to find wildcard commands easly with strstr
       function. */
    spaces_trim(p_cli->p_ctx->temp_buff);
    p_cli->p_ctx->cmd_tmp_buff_len = cli_strlen(p_cli->p_ctx->temp_buff) + 1;  // +1 for EOS
#endif

    cursor_end_position_move(p_cli);
    if (!cursor_in_empty_line(p_cli))
    {
        cursor_next_line_move(p_cli);
    }

    /* create argument list */
    quote = make_argv(&argc,
                      &argv[0],
                      p_cli->p_ctx->cmd_buff,
                      NRF_CLI_ARGC_MAX);

    if (!argc)
    {
        cursor_next_line_move(p_cli);
        return;
    }

